let handler = m => m; 

 handler.all = async function (m) { 
 let chat = global.db.data.chats[m.chat]; 
 let responses; 
 if (/^ساسكي بحبك|ساسكي عاوزه اتجوزك|بحبك|بموت فيك|نتجوز|ساسكي هنتجوز امتي|ساسكي انت ليا|ساسكي بموت فيك$/i.test(m.text)) { 
 responses = [ 
 'شكرا',  
 'هفكر في الموضوع',  
 'و انا',  
 'استحيت',  
 'خلاص لا اتكسف ',  
 'اسكتتتتت عشان مضربكش عيب الكلام ده   ',  
 'طيب و بعدين '  
 ]; 
}
if (/^السلام عليكم|سلام عليكم ورحمه الله وبركاته|سلام عليكم|السلام عليكم ورحمه الله وبركاته$/i.test(m.text)) { 
 responses = [ 
 'وعليكم السلام',  
 'وعليكم السلام حبي متور',  
 ' وعليكم السلام كيفك',  
 'وعليكم السلام ورحمة الله وبركاته' 
 ]; 
 }
if (/^ ساسكي عامل ايه|عامله ايه|عاملين ايه|الدنيا عامله ايه|عاملين ايه يشباب$/i.test(m.text)) { 
 responses = [ 
 'كل شيء بخير الحمد لله ',  
 ' مش عارف  ',  
 ' الحمد لله ماشي الحال ',  
 'الحمد الله',  
 ' لو انت كويس انا كويس' 
 ];  
 }
if (/^تم تعريب هذا الامر|تم الانتهاء|تمت اضافه|تمت اضافة|تم التعريب|هذا الامر انتهي$/i.test(m.text)) { 
 responses = [ 
 ' عاشت ايدك ✨💜',  
 'تسلم ايدك ✨💜 ',  
 'عاش ✨💜 ',  
 'عاش بن تن ✨💜',  
 'اوكي ✨💜' 
 ]; 
 }
 }
  if (/^صباح النور|صباح النعناع الاخصر|صباح الفل|صباح|صباح الخير $/i.test(m.text)) { 
 responses = [ 
 'صباح الفل ✨💜',  
 'صباح النور ✨💜 ',  
 ' صباح الكاريزما ✨💜',  
 'انت صحيت وانا رايح انام 🐦👋🏻 ',  
 'روح نام تاني بقي 🙃' 
 ]; 
 }
  if (/^شكرا|تسلم|تسلمي$/i.test(m.text)) { 
 responses = [ 
 'العفو✨♥',  
 ' ولا يهمك مفيش حاجه✨💫 ',  
 ' الشكر لله ✨💜',  
 'العفو يبشه ✨💜' 
]; 
 }
  if (/^🧡|💚|💞|💖|💜|💛|🤍$/i.test(m.text)) { 
 responses = [ 
 'شكرا✨♥',  
 'تسلم✨♥',  
 '✨♥',  
 'حبيبي✨💜',  
 '✨💜' 
 ]; 
 }
  if (/^منوره|كل ده نور|الجروب نور كده ليه|ايه النور ده|منورين الجدد|منورين|منور $/i.test(m.text)) { 
 responses = [ 
 'نوري انا✨♥',  
 'الجروب نور فعلا✨♥',  
 '✨♥',  
 'الجروب منور✨💜',  
 '✨💜' 
 ]; 
 }
  if (/^اسكت|اسكت|هتسكت امتي|يا ابني اسكت$/i.test(m.text)) { 
 responses = [ 
 'ملكش دعوه ', 
              'لع وانت مالك',  
                 ' مش بمزاجك',  
 'لا مين انت ال هتسكتني ',  
 'اسكت انت' 
 ]; 
 }  
 if (responses) { 
 let randomIndex = Math.floor(Math.random() * responses.length); 
 conn.reply(m.chat, responses[randomIndex], m); 
 } 
 return !0 
 }; 

 export default handler;