const _0x41a8fd = _0x2fa3;
(function (_0x3a2f11, _0x323215) {
    const _0x449fd3 = _0x2fa3;
    const _0x7f139c = _0x3a2f11();
    while (!![]) {
        try {
            const _0x4319e8 = -parseInt(_0x449fd3(0xd)) / 0x1 + parseInt(_0x449fd3(0x2b)) / 0x2 + -parseInt(_0x449fd3(0xb)) / 0x3 + -parseInt(_0x449fd3(0x5)) / 0x4 * (parseInt(_0x449fd3(0xe)) / 0x5) + -parseInt(_0x449fd3(0x6)) / 0x6 + parseInt(_0x449fd3(0x13)) / 0x7 + parseInt(_0x449fd3(0x7)) / 0x8 * (parseInt(_0x449fd3(0x1a)) / 0x9);
            if (_0x4319e8 === _0x323215) {
                break;
            } else {
                _0x7f139c['push'](_0x7f139c['shift']());
            }
        } catch (_0x955543) {
            _0x7f139c['push'](_0x7f139c['shift']());
        }
    }
}(_0x2098, 0xaa355));
const handler = async (_0x16fe25, {
    conn: _0x50ba4b,
    command: _0x5255ba,
    text: _0x56fe7d
}) => {
    const _0xb02b2c = _0x2fa3;
    const _0x27168b = Math[_0xb02b2c(0x16)](Math[_0xb02b2c(0x25)]() * 0x64);
    const _0x38b55c = _0x27168b >= 0x32;
    const _0x5ddc66 = [_0xb02b2c(0x1), 'يبدو أن هناك شرارة بينكما. ¡كلمها!', _0xb02b2c(0x18), _0xb02b2c(0xa), 'تشير النجوم إلى أن هناك إمكانات رومانسية. اجعل حركة!', 'يمكن أن تكون قصة حب لا تصدق تنتظر أن تكتبها.', _0xb02b2c(0x1d), _0xb02b2c(0x26), _0xb02b2c(0x1e), 'الحب الحقيقي غالبا ما يستغرق الوقت والجهد. لا تستسلم!'];
    const _0x38cf6c = [_0xb02b2c(0x14), _0xb02b2c(0x15), _0xb02b2c(0x23), 'في بعض الأحيان يمكن أن ينمو الحب مع مرور الوقت. استمر في تقوية اتصالك!', _0xb02b2c(0x0), _0xb02b2c(0xf), _0xb02b2c(0x2a), _0xb02b2c(0x4), _0xb02b2c(0x19), _0xb02b2c(0x29)];
    const _0x583e65 = _0x38b55c ? 'لديهم اتصال عميق والحب' : _0xb02b2c(0x9);
    const _0x235550 = _0x1045c5 => _0x1045c5[Math[_0xb02b2c(0x16)](Math[_0xb02b2c(0x25)]() * _0x1045c5[_0xb02b2c(0x28)])];
    const _0x2fadc7 = _0x38b55c ? _0x235550(_0x5ddc66) : _0x235550(_0x38cf6c);
    const _0x429c9b = _0xb02b2c(0x2) + (_0xb02b2c(0x1f) + _0x56fe7d + _0xb02b2c(0x22) + _0x16fe25['sender'][_0xb02b2c(0x12)]('@')[0x0] + ' ' + _0x583e65 + _0xb02b2c(0x24) + _0x27168b + _0xb02b2c(0x1b)) + (_0xb02b2c(0x8) + _0x2fadc7 + '*\x0a') + '━━━━━━━⬣ *Sasuke* ⬣━━━━━━━';
    async function _0x76d6b3() {
        const _0x3cb503 = _0x2fa3;
        var _0x15610c = ['《 █▒▒▒▒▒▒▒▒▒▒▒》10%', _0x3cb503(0x21), _0x3cb503(0x20), '《 ██████████▒▒》80%', _0x3cb503(0x1c)];
        let {
            key: _0x5bcfd5
        } = await _0x50ba4b[_0x3cb503(0xc)](_0x16fe25[_0x3cb503(0x3)], {
            'text': '*💞 ¡حساب النسبة المئوية! 💞*',
            'mentions': _0x50ba4b['parseMention'](_0x429c9b)
        }, {
            'quoted': _0x16fe25
        });
        for (let _0x2e0713 = 0x0; _0x2e0713 < _0x15610c[_0x3cb503(0x28)]; _0x2e0713++) {
            await new Promise(_0x28350e => setTimeout(_0x28350e, 0x3e8));
            await _0x50ba4b[_0x3cb503(0xc)](_0x16fe25[_0x3cb503(0x3)], {
                'text': _0x15610c[_0x2e0713],
                'edit': _0x5bcfd5,
                'mentions': _0x50ba4b[_0x3cb503(0x11)](_0x429c9b)
            }, {
                'quoted': _0x16fe25
            });
        }
        await _0x50ba4b[_0x3cb503(0xc)](_0x16fe25[_0x3cb503(0x3)], {
            'text': _0x429c9b,
            'edit': _0x5bcfd5,
            'mentions': _0x50ba4b[_0x3cb503(0x11)](_0x429c9b)
        }, {
            'quoted': _0x16fe25
        });
    }
    _0x76d6b3();
};
handler[_0x41a8fd(0x17)] = ['love'];

function _0x2fa3(_0x15b765, _0x209875) {
    const _0x2fa378 = _0x2098();
    _0x2fa3 = function (_0x25b5bc, _0x2305b2) {
        _0x25b5bc = _0x25b5bc - 0x0;
        let _0x762ded = _0x2fa378[_0x25b5bc];
        return _0x762ded;
    };
    return _0x2fa3(_0x15b765, _0x209875);
}

function _0x2098() {
    const _0x3d6f4f = ['1798068wOkbhL', 'sendMessage', '511458ZEXGKP', '15MbxqDz', 'حتى لو لم يزدهر الحب كما هو متوقع، فإن اتصالك لا يزال ذا قيمة.', 'command', 'parseMention', 'split', '9466681PSXGas', 'في بعض الأحيان تكون الصداقة بداية لشيء جميل، لكنها لا تتحول دائمًا إلى حب.', 'الحب ليس كل شيء، الصداقة عظيمة أيضًا! حافظ على صداقتك مميزة.', 'floor', 'help', 'يمكن أن يكون هناك شيء مميز هنا. امنحه صحة!', 'الوقت يمكن أن يكشف أشياء مذهلة. دعونا نواصل الاستكشاف معًا!', '9xaKlMd', '% من 100%*\x0a\x0a', '《 ████████████》100%', 'لا تقلل من شأن قوة الوقت والصبر في الحب. يمكن أن تحدث أشياء عظيمة.', 'الروابط القوية يمكن أن تصبح علاقات جميلة. استمر في الاستكشاف!', '*❥ في عالم الحب, ', '《 ███████▒▒▒▒▒》50%', '《 ████▒▒▒▒▒▒▒▒》30%', ' y @', 'تذكر أن أفضل العلاقات تبدأ بصداقة جيدة. لا نقلل من السندات الخاصة بك!', ' التابع ', 'random', 'تذكر أن الحب رحلة، وكل خطوة لها قيمة، مهما كانت المسافة.', 'fun', 'length', 'الحياة مليئة بالمنعطفات غير المتوقعة. ابق منفتحًا على الاحتمالات!', 'قد يستغرق تزامن القلوب بعض الوقت، لكن هذا لا يقلل من مدى تميزكما معًا.', '1250872aYlZko', 'الحياة مفاجأة، من يدري ما يخبئه المستقبل! لا تفقد الأمل.', '¡هذا حب محترق وعاطفي! ¡اذهب وقلها الآن!', '━━━━━━━⬣ *Ben10* ⬣━━━━━━━\x0a', 'chat', 'على الرغم من تحديات الحب، فإن صداقتك هي هدية تستحق الاحتفال بها.', '1149404KfUPck', '872892HDsDIZ', '6701624vKSXne', '*❥ ', 'ديهم ارتباط خاص، رغم أن نسبتهم في الحب هي', 'حسنًا ، الحب في الهواء. ربما حان الوقت لتناول القهوة معًا!'];
    _0x2098 = function () {
        return _0x3d6f4f;
    };
    return _0x2098();
}
handler['tags'] = [_0x41a8fd(0x27)];
handler[_0x41a8fd(0x10)] = /^(love|الحب)$/i;
export default handler;