let handler = async (m, { command, text }) => m.reply(`⦓           ⦓🏆⦔          ⦔ـ
⌟🍄⌜ قـسـم الـتـحـويـلات 
⦓           ⦓🏆⦔          ⦔ـ
📍❯ ⏐ .لانـمـي
☫ ⌟لتحويل الصوره لانمي⌜
📍❯ ⏐ .جـيـف
☫ ⌟لتحويل الفيديو لgif⌜
📍❯ ⏐ .لـصـوره
☫ ⌟لتحويل الملصق لصوره⌜
📍❯ ⏐ .لـصـوت
☫ ⌟لتحويل الفيديو لصوت⌜
📍❯ ⏐ .لـريـك
☫ ⌟لتحويل الفيديو لريكورد⌜
📍❯ ⏐ .لـفـيـديـو
☫ ⌟لتحويل الملصق لفيديو⌜
📍❯ ⏐ .تـلـيـجـراف
☫ ⌟لتحويل الاشياء الي تليجراف⌜
📍❯ ⏐ .انـطـق
☫ ⌟لتحويل النص الي صوت⌜
> Ben10`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['اوامر <teks>?']
handler.tags = ['اوامر', 'fun']
handler.command = /^(قسم_التحويلات|س5)$/i

export default handler