let handler = async (m, { command, text }) => m.reply(`⦓           ⦓🏆⦔          ⦔ـ
⌟🎡⌜ قـسـم الاعـضـاء
⦓           ⦓🏆⦔          ⦔ـ
🍓❯ ⏐ .الـبـنـك 
☫ ⌟لعرض قائمة البنك⌜
🍓❯ ⏐ .الـمـتـجـر 
☫ ⌟لعرض قائمة اصور المتجر⌜
🍓❯ ⏐ .لرابط 
☫ ⌟لتحويل الصوره لرابط⌜
🍓❯ ⏐ .لرابط2
☫ ⌟لتحويل الصوره لرابط بموقع  مختلف⌜
🍓❯ ⏐ .الـوجـوهـات 
☫ ⌟لعرض قائمة الوجوهات⌜ 
🍓❯ ⏐ .لـوجـو-حـب
☫ ⌟لعرض قائمه الاصوات⌜ 
🍓❯ ⏐ .كـومـنـت 
☫ ⌟يعملك كومنت مشهور⌜ 
🍓❯ ⏐.الـمـطـور 
☫ ⌟يبعتلك رقم صاحب البوت⌜
🍓❯ ⏐ .بـروفـايـل 
☫ ⌟يبعتلك قائمة بروفايلك⌜
🍓❯ ⏐ .مـيـمـز 
☫ ⌟يبعتلك ميمز عن الانمي⌜
🍓❯ ⏐ .تـطـقـيـم 
☫ ⌟يبعتلك صور بنت و ولد⌜
🍓❯ ⏐ .جـوده  
☫ ⌟لتحسين جودة الصوره⌜
🍓❯ ⏐ .فرغ  
☫ ⌟يحذف خلفيه الصوره⌜
🍓❯ ⏐ .الـطـقـس  
☫ ⌟يجبلك طقس البلاد⌜
🍓❯ ⏐ .بـاركـود  
☫ ⌟يعملك النص qr code⌜
🍓❯ ⏐ .زخـرفـه 
☫ ⌟يزخرف الكلام بالانجليزي⌜
🍓❯ ⏐ .حـكـمـه 
☫ ⌟البوت يعطيك حـكـمـه⌜
🍓❯ ⏐ .نـصـيـحـه 
☫ ⌟يزخرف الكلام بالانجليزي⌜
🍓❯ ⏐ .تـصـليـح 
☫ ⌟ليظهرلك رسائل البوت⌜
🍓❯ ⏐ .صوره 
☫ ⌟يبحث عن صوره بواصته جوجل⌜
🍓❯ ⏐ .تـنـضـيف 
☫ ⌟لتنضيف اوامر البوت⌜
🍓❯ ⏐ .مـعـلـومـات 
☫ ⌟يبعتلك كل معلومات البوت⌜
🍓❯ ⏐ .الـحـالـه 
☫ ⌟يبعتلك وقت تشغيل البوت⌜
🍓❯ ⏐ .انـضـم 
☫ ⌟ليتم انضمام البوت لي جروبك⌜
🍓❯ ⏐ .الـسـرعـه 
☫ ⌟يبعتلك سرعة البوت⌜
> Ben10`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['اوامر <teks>?']
handler.tags = ['اوامر', 'fun']
handler.command = /^(قسم_الاعضاء|س2)$/i

export default handler