let handler = async (m, { command, text }) => m.reply(`⦓           ⦓🏆⦔          ⦔ـ
⌟🛰⌜قـسـم الـذكـاء الاصـطـيـنـعـي
⦓           ⦓🏆⦔          ⦔ـ
🌏❯ ⏐ .بـوت
☫ ⌟ للرد علي الاسئلة بشكل بشري⌜
🌏❯ ⏐ .جي-بي-تي
☫ ⌟ للرد علي الاسئلة من شات جي بي تي  ⌜
🌏❯ ⏐ .جيميني
☫ ⌟ للرد علي الاسئلة من جيميني⌜
🌏❯ ⏐ .ساسكي
☫ ⌟للرد علي الاسئله كنه ساسكي⌜
🌏❯ ⏐ .بن-تن
☫ ⌟للرد علي الاسئله كنه بن تن⌜
🌏❯ ⏐ .لوفي 
☫ ⌟للرد علي الاسئله كنه لوفي⌜
🌏❯ ⏐ .كيلوا 
☫ ⌟للرد علي الاسئله كنه كيلوا⌜
🌏❯ ⏐ .ايرين 
☫ ⌟للرد علي الاسئله كنه ايرين⌜
🌏❯ ⏐ .غوكو 
☫ ⌟للرد علي الاسئله كنه غوكو⌜
🌏❯ ⏐ .احسب 
☫ ⌟لحساب المعادلات الصعبه بالانجليزي⌜
🌏❯ ⏐ .الطقس 
☫ ⌟معرفه الجو في العالم⌜

JoAnimi شكرا للمطور
> Ben10`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['اوامر <teks>?']
handler.tags = ['اوامر', 'fun']
handler.command = /^(قسم_الذكاء_الاصتناعي|س1)$/i

export default handler