let handler = async (m, { command, text }) => m.reply(`⦓           ⦓🏆⦔          ⦔ـ
⌟🖼⌜ قـسـم الـصـور 
⦓           ⦓🏆⦔          ⦔ـ
🌱❯ ⏐ .كـانـيـكـي 
☫ ⌟يبعت صور كانيكي⌜
🌱❯ ⏐ . مـادارا 
☫ ⌟يبعت صور مادارا⌜
🌱❯ ⏐ .مـيـنـاتـو 
☫ ⌟يبعت صور ميناتو⌜
🌱❯ ⏐ .مـيـكاسـا 
☫ ⌟يبعت صور ميكاسا⌜
🌱❯ ⏐ . كيوت
☫ ⌟يبعت صور كيوت⌜
🌱❯ ⏐ .قـط 
☫ ⌟يبعت صور قطط⌜
🌱❯ ⏐ .كـلـب
☫ ⌟يبعت صور كلاب⌜
🌱❯ ⏐ .جيمينج 
☫ ⌟يبعت صور جيمينج⌜
🌱❯ ⏐ .رونـالـدو 
☫ ⌟يبعت صور رونالدو⌜
🌱❯ ⏐ .مـيـسـي 
☫ ⌟يبعت صور ميسي⌜
🌱❯ ⏐ .تكنولوجيا 
☫ ⌟يبعت صور تكنولوجيا⌜
🌱❯ ⏐ .عـشـوائـي 
☫ ⌟يبعت صور عشوائيه⌜
🌱❯ ⏐ .عـيـد 
☫ ⌟يبعت صور عيد صاحبي🗿⌜
🌱❯ ⏐ .جـبـل 
☫ ⌟يبعت صور جبال⌜
🌱❯ ⏐ .بـبـجـي 
☫ ⌟يبعت صور ببجي⌜
🌱❯ ⏐ .بلاك-بينك 
☫ ⌟يبعت صور بلاك بينك⌜
🌱❯ ⏐ .درايمون 
☫ ⌟يبعت صور معرفش⌜
🌱❯ ⏐ .هـكـر 
☫ ⌟يبعت صوري عشان انا هكر🗿⌜
🌱❯ ⏐ .كـوكـب 
☫ ⌟يبعت صور كواكب⌜
🌱❯ ⏐ . كـرتـون 
☫ ⌟يبعت صور كرتون⌜
> Ben10`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['اوامر <teks>?']
handler.tags = ['اوامر', 'fun']
handler.command = /^(قسم_الصور)$/i

export default handler