let handler = async (m, { command, text }) => m.reply(`⦓           ⦓🏆⦔          ⦔ـ
⌟🍀⌜ قـسـم الـجـروب
⦓           ⦓🏆⦔          ⦔ـ
💌❯ ⏐ .انـذار
☫ ⌟بيعطي للعضو انذار⌜
💌❯ ⏐ .حـذف-الانـذار
☫ ⌟بيحذف الانذار⌜
💌❯ ⏐ .الانـذارات
☫ ⌟يبعت قائمه انذاراتك⌜
💌❯ ⏐ .القاب
☫ ⌟هم اكتر من 6 اوامر مكسل اكتبهم⌜
💌❯ ⏐ .جـروب غلق
☫ ⌟يقفل شات الجروب⌜
💌❯ ⏐ جـروب فتح
☫ ⌟يفتح شات الجروب⌜
💌❯ ⏐ .اعـدادات قفل 1
☫ ⌟يقفل الشات بوقت⌜
💌❯ ⏐ .اعـدادات فتح 1
☫ ⌟يفتح الشات بي وقت⌜
💌❯ ⏐ .تـغيـرالاسم
☫ ⌟بيغير اسم الجروب⌜
💌❯ ⏐ .تـغيـرالصوره
☫ ⌟بيغير صوره الجروب ⌜
💌❯ ⏐ .تـغيـرالوصف
☫ ⌟بيغير وصف الجروب⌜
💌❯ ⏐ .تـغيـرالترحيب
☫ ⌟بيغير ترحيب البوت⌜
💌❯ ⏐ .تـغيـرالوداع
☫ ⌟بيغير وادع البوت⌜
💌❯ ⏐ .قـائـمـه-الارقـام
☫ ⌟بيجبلك قائمة الارقام برمز الدوله⌜
💌❯ ⏐ .مـخـفـي
☫ ⌟بيعمل منشن وهمي ⌜
💌❯ ⏐ .تـرقـيـه
☫ ⌟بيرفع عضو ادمن⌜
💌❯ ⏐ .خـفـض
☫ ⌟بيتزل ادمن عضو⌜
💌❯ ⏐ .طرد
☫ ⌟بيطرد اي حد⌜
💌❯ ⏐ .لـيـنـك
☫ ⌟بيبعت لينك الجروب⌜
💌❯ ⏐ .مـنـشـن
☫ ⌟يعمل منشن جماعي⌜
💌❯ ⏐ .الادمـن☫ ⌟يعمل منشن للادمن⌜
💌❯ ⏐ .رسـتـر
☫ ⌟يرستر رابط الجروب⌜
💌❯ ⏐ .الاشـبـاح
☫ ⌟يمنشن الناس الي مش بتتفاعل⌜
> Ben10`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['اوامر <teks>?']
handler.tags = ['اوامر', 'fun']
handler.command = /^(قسم_الجروب|س3)$/i

export default handler
