let handler = async (m, { command, text }) => m.reply(`⦓           ⦓🏆⦔          ⦔ـ
⌟🎯⌜ قـسـم الالـعـاب 
⦓           ⦓🏆⦔          ⦔ـ
🕹❯ ⏐ .العب
☫ ⌟تلعب حجر ورقه مع البوت⌜
🕹❯ ⏐ .عين
☫ ⌟احزر الشخصية من العين⌜
🕹❯ ⏐ .علم
☫ ⌟احزر الدوله من العلم⌜
🕹❯ ⏐ .احزر
☫ ⌟احزر الشخصية من الصوره⌜
🕹❯ ⏐ .هل 
☫ ⌟بيجاوب على سؤال⌜
🕹❯ ⏐ .تحدي
☫ ⌟حجر ورقه مقص مع صاحبك⌜
🕹❯ ⏐ .حظ
☫ ⌟لعبة الحظ مع البوت⌜
🕹❯ ⏐ .اكس
☫ ⌟لعبة اكس او مع صديقك⌜
🕹❯ ⏐ .كت
☫ ⌟يجيب لك شخصيه انمي عشوائيه⌜
🕹❯ ⏐ .سؤال
☫ ⌟سؤال من عالم انمي⌜
🕹❯ ⏐ .توب
☫ ⌟يعمل منشن ل 10 أعضاء⌜
🕹❯ ⏐ .زواج
☫ ⌟يجوز اتنين في الجروب 🤣⌜
🕹❯ ⏐ .طلاق
☫ ⌟يطلق اتنين في الجروب 💔⌜
🕹❯ ⏐ .هل 
☫ ⌟تسال البوت و هوا يجاوب⌜
> Ben10`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['اوامر <teks>?']
handler.tags = ['اوامر', 'fun']
handler.command = /^(قسم_الالعاب|س6)$/i

export default handler